In [ ]:
# 판다스는 2가지 오브젝트 Series, DataFrame 이 있다.
1) Series: 1차원 데이터와 인덱스로 구성 (하나의 컬럼)
2) DataFrame : 2차원 데이터와 인덱스,컬럼으로 구성 (여러개의 컬럼)

In [8]:
# Series 만들기 
import pandas as pd
import numpy as np
data = ("yuna","1900-19-19","여")   # 데이터는 리스트, 딕션너리, 튜플 등의 형태가능
s = pd.Series(data, index = ["이름", "생년월일", "성별"]) # index 를 따로 지정해 주지 않으면 0,1,2.. 숫자로 나타남

In [17]:
print(s)
type(s)

이름            yuna
생년월일    1900-19-19
성별               여
dtype: object

pandas.core.series.Series

In [19]:
s.index    # 인덱스만 불러오기

Index(['이름', '생년월일', '성별'], dtype='object')

In [20]:
s.values   # 값만 불러오기

array(['yuna', '1900-19-19', '여'], dtype=object)

In [21]:
s[0]   # 0인덱스 ( = 이름)의 값을 가져온다

'yuna'

In [22]:
s[0:2]  # 0~ 1인덱스 (= 이름, 생년월일)의 값을 가져온다 (feat 슬라이싱 이용)

이름            yuna
생년월일    1900-19-19
dtype: object

In [23]:
s[[1,2]] # 1, 2 인덱스 (= 생년월일, 성별) 의 값을 가져오기 (feat 이중괄호)

생년월일    1900-19-19
성별               여
dtype: object

In [65]:
# DataFrame 만들기 
data = {"이름":["yuna","민영","앨리"], "나이":[10,9,8],"취미":["운동","음악감상","독서"]}
df = pd.DataFrame(data, index = ["일","이","삼"])
df

     이름  나이    취미
일  yuna  10    운동
이    민영   9  음악감상
삼    앨리   8    독서

In [66]:
#  행 인덱스 & 열 이름 변경 (1)
# DataFrame 객체.index = [ ]
# DataFrame 객체.columns = [ ]

df.index = ["첫번쨰","두번쨰","세번쨰"]
df.columns = ["name","age","hobby"]
df

     name  age hobby
첫번쨰  yuna   10    운동
두번쨰    민영    9  음악감상
세번쨰    앨리    8    독서

In [67]:
#  행 인덱스 & 열 이름 변경 (2) 
# DataFrame 객체.rename(index={기존 인덱스:새 인덱스,---})
# DataFrame 객체.rename(columns={기존 이름:새 이름, ---})
df.rename(columns = {"name":"연령","age":"나이","hobby":"취미"}, inplace = True)
df.rename(index = {"첫번쨰":"1st","두번쨰":"2nd","세번쨰":"3rd"}, inplace = True)

# inplace = True는  원본 객체를 변경하는 것
df

       연령  나이    취미
1st  yuna  10    운동
2nd    민영   9  음악감상
3rd    앨리   8    독서

In [70]:
# 행  & 열 삭제 
# 행 삭제 : DataFrame 객체.drop('행 인덱스' 또는 ['배열'], axis=0)
# 열 삭제 : DataFrame 객체.drop('열 이름' 또는 ['배열'], axis=1)

df.drop("2nd", inplace = True)  # axis= 0 은 기본값이라 입력 안 해도 됨
df.drop("나이", axis = 1, inplace = True)
df

       연령  취미
1st  yuna  운동

In [71]:
import pandas as pd 
exam = {"수학":[100,90,80],"영어":[100,23,23],
    "음악": [90,12,42], "체육": [100,80,70]}

df = pd.DataFrame(exam, index = ["연아","연아2","연아3"])
df

      수학   영어  음악   체육
연아   100  100  90  100
연아2   90   23  12   80
연아3   80   23  42   70

In [76]:
# 특정 행 선택하기 
#  .loc  인덱스 이름으로 
# .iloc  인덱스 위치로 

index_1 = df.loc["연아"]
index_2 = df.iloc[0:2]
print(index_1)  
print("\n")
print(index_2)

수학    100
영어    100
음악     90
체육    100
Name: 연아, dtype: int64


      수학   영어  음악   체육
연아   100  100  90  100
연아2   90   23  12   80

In [82]:
# 특정 열 선택하기 
# Series  객체로 반환     df["열이름"] / df.열이름(한개만!)
#  DataFrame  객체로 반환   이중대괄호 [[" "] ]  ( 한개 또는 여러개)


math = df["수학"]
print(math)
print("\n")
Eng = df.영어
print(Eng)

연아     100
연아2     90
연아3     80
Name: 수학, dtype: int64


연아     100
연아2     23
연아3     23
Name: 영어, dtype: int64

In [89]:
math2 = df[["수학"]]
print(math2)
print("\n")
type(math2)
print("\n")
subject = df[["음악","체육"]]
print(subject)

      수학
연아   100
연아2   90
연아3   80




     음악   체육
연아   90  100
연아2  12   80
연아3  42   70

In [91]:
# 행/ 열 추가 
# 행추가 : DataFrame.loc['새로운 행 이름'] = 데이터 값 (또는 배열)
df.loc["연아4"] =[50,80,90,100 ]
df.loc["연아5"] = 0
df.loc["연아6"] = df.loc["연아5"]
df

      수학   영어  음악   체육
연아   100  100  90  100
연아2   90   23  12   80
연아3   80   23  42   70
연아4   50   80  90  100
연아5    0    0   0    0
연아6    0    0   0    0

In [92]:
# 열 추가하기
# 열 추가 : DataFrame 객체[ '추가하려는 열 이름' ] = 데이터 값

df["국어"]= 10,1,2,3,4,5
df

      수학   영어  음악   체육  국어
연아   100  100  90  100  10
연아2   90   23  12   80   1
연아3   80   23  42   70   2
연아4   50   80  90  100   3
연아5    0    0   0    0   4
연아6    0    0   0    0   5

In [96]:
# 행, 열 함께 선택하기 
# 인덱스 이름 : DataFrame 객체.loc[행 인덱스, 열 이름]
# 정수 위치 인덱스 : DataFrame 객체.iloc[행 번호, 열 번호]

# Series객체로 반환 :1개의행과  2개이상의 열 or 2개 이상의 행과 1개의 열
# DataFrame 을반환 : 2개의 이상의 행과 2개 이상의 열 


# 원소 1개 추출
a = df.loc["연아","체육"]
print(a)
print("\n")
b = df.iloc[1,2]
print(b)

100


12

In [103]:
# 원소 2개 추출 (시리즈..)
c = df.loc["연아",["수학","영어"]]
print(c)
d = df.loc["연아2","수학":"체육"]
print("\n")
print(d)
print("\n")
e = df.iloc[0,2:]
print(e)

수학    100
영어    100
Name: 연아, dtype: int64


수학    90
영어    23
음악    12
체육    80
Name: 연아2, dtype: int64


음악     90
체육    100
국어     10
Name: 연아, dtype: int64

In [113]:
# 행, 열 각각 2개 이상 추출하여 Dataframe 으로 만들기 

g = df.loc[["연아","연아2" ],["수학","영어" ]]
print(g)

      수학   영어
연아   100  100
연아2   90   23

In [118]:
# 원소값 변경하기 
# 정 원소 1개 또는 여러개를 인덱싱과 슬라이싱 기법으로 변경하기 
h = df.loc["연아",["수학","영어"]] = 70,60
print(h)
i = df.iloc[0,[1,2]] = 11,22
print(i)
df

(70, 60)
(11, 22)

     수학  영어  음악   체육  국어
연아   70  11  22  100  10
연아2  90  23  12   80   1
연아3  80  23  42   70   2
연아4  50  80  90  100   3
연아5   0   0   0    0   4
연아6   0   0   0    0   5

In [129]:
# 행,열 위치 바꾸기 (transpose)
# 행,열 바꾸기 : DataFrame 객체.transpose() 또는 DataFrame 객체.T

df = df.T
print(df)
df_2 = df.transpose()
print("\n")
print(df_2)

     수학  영어  음악   체육  국어
연아   70  11  22  100  10
연아2  90  23  12   80   1
연아3  80  23  42   70   2
연아4  50  80  90  100   3
연아5   0   0   0    0   4
연아6   0   0   0    0   5


     연아  연아2  연아3  연아4  연아5  연아6
수학   70   90   80   50    0    0
영어   11   23   23   80    0    0
음악   22   12   42   90    0    0
체육  100   80   70  100    0    0
국어   10    1    2    3    4    5

In [135]:
# 인덱스 활용
# 1) .set_index  특정 열을 행 인덱스로 정한다 
# 특정 열을 행 인덱스로 설정 : DataFrame 객체.set_index( ['열 이름' ] 또는 '열 이름')
# 원본 데이터 프레임을 바꾸지 않고 새로운 데이터 프레임을 반환
new_df = df.set_index(["수학"])
print(new_df)
print("\n")
print(df)
print("\n")
new_df3 = df.set_index(["수학","영어"])
print(new_df3)

    영어  음악   체육  국어
수학
70  11  22  100  10
90  23  12   80   1
80  23  42   70   2
50  80  90  100   3
0    0   0    0   4
0    0   0    0   5


     수학  영어  음악   체육  국어
연아   70  11  22  100  10
연아2  90  23  12   80   1
연아3  80  23  42   70   2
연아4  50  80  90  100   3
연아5   0   0   0    0   4
연아6   0   0   0    0   5


       음악   체육  국어
수학 영어
70 11  22  100  10
90 23  12   80   1
80 23  42   70   2
50 80  90  100   3
0  0    0    0   4
   0    0    0   5

In [139]:
# 2) 행 인덱스 재배열 .reindex()
# 새로운 배열로 행 인덱스를 재지정 : DataFrame 객체.reindex(새로운 인덱스 배열)

new_index = ["연아","연아2","연아3","r4","r5","r6"]
ndf = df.reindex(new_index)
ndf  # 기존에 존재않는 행 인덱스가 새로 생길 경우 값은 NaN 가 된다

       수학    영어    음악     체육    국어
연아   70.0  11.0  22.0  100.0  10.0
연아2  90.0  23.0  12.0   80.0   1.0
연아3  80.0  23.0  42.0   70.0   2.0
r4    NaN   NaN   NaN    NaN   NaN
r5    NaN   NaN   NaN    NaN   NaN
r6    NaN   NaN   NaN    NaN   NaN

In [140]:
# 3) 행 인덱스 초기화 reset_index()
ndf = df.reset_index()
ndf

  index  수학  영어  음악   체육  국어
0    연아  70  11  22  100  10
1   연아2  90  23  12   80   1
2   연아3  80  23  42   70   2
3   연아4  50  80  90  100   3
4   연아5   0   0   0    0   4
5   연아6   0   0   0    0   5

In [146]:
# 4)  행 인덱스를기준으로 데이터 프레임 정렬 .sort_index()
# ascending=True or False 옵션을 사용해 오름차순 또는 내림차순을 설정

ndf = df.sort_index(ascending = False)
print(ndf)
print("\n")
# 5) 특정 열의 데이터 값을 기준으로 정렬하기 
# 열 기준 정렬 : DataFrame 객체.sort_values()
ndf2 = df.sort_values(by= "수학",ascending = False)
print(ndf2)

     수학  영어  음악   체육  국어
연아6   0   0   0    0   5
연아5   0   0   0    0   4
연아4  50  80  90  100   3
연아3  80  23  42   70   2
연아2  90  23  12   80   1
연아   70  11  22  100  10


     수학  영어  음악   체육  국어
연아2  90  23  12   80   1
연아3  80  23  42   70   2
연아   70  11  22  100  10
연아4  50  80  90  100   3
연아5   0   0   0    0   4
연아6   0   0   0    0   5